app/Controllers/User.php

SELECT *
FROM `tb_user`
WHERE `tb_user`.`customer` = 'admin'
---
    public function cek()
{
    $customer = $this->request->getPost('customer');
    $password = $this->request->getPost('password');

    $userModel = new UserModel();
    $userData = $userModel->find($customer);

INSERT INTO `tb_user` (`customer`, `email`, `password`, `country`, `phone_number`) VALUES ('admin', 'admin@gmail.com', 'admin123', 'Indonesia', '12441414')
---
    public function registersave()
    {
        $data = [];

        if ($this->request->getMethod() === 'post') {
            $model = new UserModel();

            $userData = [
                'customer' => $this->request->getPost('customer'),
                'email' => $this->request->getPost('email'),
                'password' => $this->request->getPost('password'),
                'country' => $this->request->getPost('country'),
                'phone_number' => $this->request->getPost('phone_number'),
            ];

            $model->insert($userData);