app/Models/ContactModel.php

    public function getAllData()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_contact');
        return $builder->get()->getResult();
---
SELECT *
FROM `tb_contact`