app/Models/GameModel.php

SELECT *
FROM `tb_game`
---
    public function getAllData()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_game');
        return $builder->get()->getResult();