app/Models/TransaksiModel.php

SELECT `tb_transaksi`.*, `tb_game`.`id_game`, `tb_game`.`top_up`, `tb_game`.`name_game`, `tb_user`.`customer`
FROM `tb_transaksi`
JOIN `tb_game` ON `tb_game`.`id_game` = `tb_transaksi`.`id_game`
JOIN `tb_user` ON `tb_user`.`customer` = `tb_transaksi`.`customer`
---
    public function getAllDataWithRelation()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_transaksi');

        $result = $builder
            ->select('tb_transaksi.*, tb_game.id_game, tb_game.top_up, tb_game.name_game, tb_user.customer')
            ->join('tb_game', 'tb_game.id_game = tb_transaksi.id_game')
            ->join('tb_user', 'tb_user.customer = tb_transaksi.customer')
            ->get()
            ->getResult();