app/Models/UserModel.php

SELECT *
FROM `tb_user`
---
    public function getAllData()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_user');
        return $builder->get()->getResult();

DELETE FROM `tb_user`
WHERE `customer` = 'admin'
---
    public function deleteData($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('tb_user');
        $builder->where('customer', $id);
        return $builder->delete();